# Chapter3 Data Wragling 

- 작성자: 박하람
- 파트: 3.0 소개 ~ 3.10 열 삭제하기
- 원본 데이터를 정제하고 사용가능한 형태로 구성하기 위한 변환 과정을 광범위하게 의미하는 비공식적 용어 
- Pandas를 활용한 전처리 작업 목적

In [3]:
import pandas as pd 
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 데이터프레임 만들기

In [4]:
# numpy에 주입해 만들기 
import numpy as np 

data = [['Haram Park', 26, True], ['Young-joo Lee', 21, False]]
matrix = np.array(data)
pd.DataFrame(matrix, columns=['Name','Age','Driver'])

            Name Age Driver
0     Haram Park  26   True
1  Young-joo Lee  21  False

## 데이터 특징 파악하기

In [5]:
df.shape

(1313, 6)

In [6]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## 데이터프레임 탐색하기

In [7]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [8]:
df[['Age','Sex']].head()

     Age     Sex
0  29.00  female
1   2.00  female
2  30.00    male
3  25.00  female
4   0.92    male

## 조건에 따라 행 선택하기

In [9]:
df[df['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [10]:
df[(df['Sex'] == 'female') & (df['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## 값 치환하기

In [11]:
# 남성, 여성 바꾸기 
df['Sex'].replace(['female','male'], ['Woman','Man']).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [12]:
# 정규표현식도 인식함
df.replace(r'1st', 'First', regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

In [13]:
# 여러개의 원소를 동일한 단어로 바꾸는 것 가능 
df.replace(['female','male'],'person').head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  person         1        1
1          Allison, Miss Helen Loraine    1st   2.0  person         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0  person         0        0

In [14]:
# female=1, male=0
df.replace({'female':1, 'male':0}).head(3)

                                  Name PClass   Age  Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0    1         1        1
1          Allison, Miss Helen Loraine    1st   2.0    1         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    0         0        0

## 열 이름 바꾸기

In [16]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [19]:
# 전체 열의 이름을 동시에 바꾸려면! 
import collections 

column_names = collections.defaultdict(str)

for name in df.columns: 
    column_names[name]
    
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [20]:
# 인덱스 0을 -1로 바꾸기 
df.rename(index={0:-1}).head(2)

                            Name PClass   Age     Sex  Survived  SexCode
-1  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
 1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [21]:
# 열 이름을 소문자로 바꿈 
df.rename(str.lower, axis='columns').head(2)

                           name pclass   age     sex  survived  sexcode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

## 기술통계값 계산하기

In [23]:
print(df['Age'].max())
print(df['Age'].min())
print(df['Age'].mean())
print(df['Age'].sum())
print(df['Age'].count())

71.0
0.17
30.397989417989418
22980.88
756

In [24]:
df.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

## 고유한 값 찾기

In [25]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [28]:
# 고유한 값의 개수
df['PClass'].nunique()

4

In [27]:
df.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

## 누락된 값 다루기

In [29]:
df[df['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [30]:
# NaN 값으로 바꾸려면 np.nan 사용! 
df['Sex'] = df['Sex'].replace('male', np.nan)

In [32]:
# NaN 등을 누락값으로 하지 않고 특정값을 누락으로하고 싶을 때! 
df = pd.read_csv(url, na_values=['female'], keep_default_na=False)
df[12:14]

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [33]:
# 누락된 값 지정! 
df = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

## 열 삭제하기

In [34]:
df.drop(['Age','Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [35]:
df.drop(df.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1